frontend/views/products/index.php

SELECT * FROM `products` WHERE (`cath`=1) AND (`parent`=0)
---
foreach ($data as $item) {
	echo Html::beginTag('div', ['class' => 'block']).Html::tag('div', $item->title.Html::tag('span', '', ['class' => 'glyphicon glyphicon-chevron-down']), ['class' => 'spoiler active']);
	echo Html::beginTag('div', ['class' => 'products-list container']);
	$models = new ActiveDataProvider([
		'query' => Products::find()->where(['cath' => $item->id, 'parent' => 0]),
	]);